# FilterNumericLessOrEqual Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilterNumericLessOrEqual Constructor
FilterNumericLessOrEqual Class See Also
---
Constructs an instance of FilterNumericLessOrEqual.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public FilterNumericLessOrEqual()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
FilterNumericLessOrEqual()
```

# See Also
FilterNumericLessOrEqual Class
Autodesk.Revit.DB Namespace